# Лабораторная работа №6
## Задание
1. Напишите программу для решения задач своего варианта.
2. Оформите отчёт в README.md. Отчёт должен содержать:
    - Условия задач
    - Описание проделанной работы
    - Скриншоты результатов
    - Ссылки на используемые материалы
## Ход работы 
### 1. Напишите программу для решения задач своего варианта. (Вариант 1)
#### Задача 1
Тимофей составляет 5-буквенные коды из букв Т, И, М, О, Ф, Е, Й. Буква Й может использоваться в коде не более одного раза, при этом она не может стоять на первом месте, на последнем месте и рядом с буквой И. Все остальные буквы могут встречаться произвольное количество раз или не встречаться совсем. Сколько различных кодов может составить Тимофей?

```python
import itertools
alp = "ТИМОФЕЙ"
ar = itertools.product(alp, repeat=5) 
arl = []
for i in ar:
    arl.append(''.join(i))

count = 0
for e in arl:
    e[0] == 'Й'
    e[-1] == 'Й'
    if e.count('Й') > 1:
        continue
    if  e.startswith('Й'):
        continue
    if  e.endswith('Й'):
        continue
    flag = True
    for i in range(len(e)-1):
        if (e[i] == 'Й' and e[i + 1] == 'И') or (e[i + 1] == 'Й' and e[i] == 'И'):
           flag = False
           break
    if flag == True: count += 1
print(count)
```
#### Задача 2
Сколько единиц содержится в двоичной записи значения выражения $4 ^ {2020} + 2 ^ {2017} − 15?$ 
```python
n = 4**2020 + 2**2017 - 15
s = bin(n)[2:]
print(s.count('1'))
```
#### Задача 3
Найдите среди целых чисел, принадлежащих числовому отрезку $[174457; 174505]$, числа, имеющие ровно два различных натуральных делителя, не считая единицы и самого числа. Для каждого найденного числа запишите эти два делителя в два соседних столбца на экране с новой строки в порядке возрастания произведения этих двух делителей. Делители в строке также должны следовать в порядке возрастания. 
```python
a = 174457
b = 174505
k = 0
for n in range(a, b + 1):
    ds = []
    for d in range(2, n//2 + 1):
        if n % d == 0:
            ds.append(d)
            if len(ds) > 2:
                break
    if len(ds) == 2:
        print(ds[0], ds[1], ds[0] * ds[1])
```
### 2. Оформите отчёт в README.md.
Это и есть отчёт md)